---
title: "Using List Comprehensions With pandas"
author: "Chris Albon"
date: 2017-12-20T11:53:49-07:00
description: "Using list comprehensions with pandas."
type: technical_note
draft: false
---

## Preliminaries

In [1]:
# Import modules
import pandas as pd

# Set ipython's max row display
pd.set_option('display.max_row', 1000)

# Set iPython's max column width to 50
pd.set_option('display.max_columns', 50)

## Create an example dataframe

In [2]:
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [4, 24, 31, 2, 3]}
df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df

             name  year  reports
Cochice     Jason  2012        4
Pima        Molly  2012       24
Santa Cruz   Tina  2013       31
Maricopa     Jake  2014        2
Yuma          Amy  2014        3

## List Comprehensions

### As a loop

In [7]:
# Create a variable
next_year = []

# For each row in df.years,
for row in df['year']:
    # Add 1 to the row and append it to next_year
    next_year.append(row + 1)

# Create df.next_year
df['next_year'] = next_year

# View the dataframe
df

             name  year  reports  next_year  previous_year
Cochice     Jason  2012        4       2013           2011
Pima        Molly  2012       24       2013           2011
Santa Cruz   Tina  2013       31       2014           2012
Maricopa     Jake  2014        2       2015           2013
Yuma          Amy  2014        3       2015           2013

In [8]:
df.year+1

Cochice       2013
Pima          2013
Santa Cruz    2014
Maricopa      2015
Yuma          2015
Name: year, dtype: int64

### As list comprehension

In [5]:
# Subtract 1 from row, for each row in df.year
df['previous_year'] = [row-1 for row in df['year']]
df

             name  year  reports  next_year  previous_year
Cochice     Jason  2012        4       2013           2011
Pima        Molly  2012       24       2013           2011
Santa Cruz   Tina  2013       31       2014           2012
Maricopa     Jake  2014        2       2015           2013
Yuma          Amy  2014        3       2015           2013

In [6]:
df.year-1

Cochice       2011
Pima          2011
Santa Cruz    2012
Maricopa      2013
Yuma          2013
Name: year, dtype: int64